class TestingPages:

    HOME_PAGE_SCOOTER = 'https://qa-scooter.praktikum-services.ru/'
    ORDER_SCOOTER_PAGE = 'https://qa-scooter.praktikum-services.ru/'
    YANDEX_DZEN_PAGE = 'https://dzen.ru/?yredirect=true'


class FAQAnswerText:
    
    FAQ_HOW_MUCH_DOES_IT_COST = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    
    FAQ_I_WANT_SEVERAL_SCOOTERS = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    
    FAQ_RENTAL_TIME_CALCULATED = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    
    FAQ_CAN_I_ORDER_FOR_TODAY = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    
    FAQ_CAN_I_EXTEND_OR_RETURN_EARLIER = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    
    FAQ_DO_YOU_BRING_CHARGER = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    
    FAQ_CAN_I_CANCEL_ORDER = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    
    FAQ_DO_YOU_DELIVER_OUTSIDE_MKAD = "Да, обязательно. Всем самокатов! И Москве, и Московской области."
    